load-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Teste de Carga">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">100</intProp>
        <intProp name="ThreadGroup.ramp_time">10</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request">
          <stringProp name="HTTPSampler.domain">reqres.in</stringProp>
          <stringProp name="HTTPSampler.path">/api/users?page=2</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Duration Assertion" enabled="true">
            <stringProp name="DurationAssertion.duration">2000</stringProp>
          </DurationAssertion>
          <hashTree/>
          <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="JSR223 Assertion" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">import org.apache.jmeter.samplers.SampleResult

// Função para calcular percentil 95 manualmente
def calculatePercentile(samples, percentile) {
    if (samples.isEmpty()) return 0
    def sortedSamples = samples.sort() // Ordena os tempos de resposta
    def index = (percentile / 100.0 * (sortedSamples.size() - 1)).round()
    return sortedSamples[index]
}

// Obtém os resultados das amostras
def sampleResults = ctx.getPreviousResult().getSubResults()
def responseTimes = sampleResults.collect { it.getTime() } // Coleta os tempos de resposta

// Cálculo do percentil 95
def responseTime95 = calculatePercentile(responseTimes, 95)

// Obtém contagens globais
def totalRequests = sampleResults.size() // Total de requisições realizadas
def failedRequests = sampleResults.count { it.isSuccessful() == false } // Requisições com erro
def errorRate = (failedRequests / totalRequests) * 100 // Taxa de erro

// Critérios de aceitação
def maxResponseTime = 2000 // Tempo máximo para 95% das requisições (em milissegundos)
def maxErrorRate = 1.0 // Taxa de erro máxima permitida (em %)

// Valida os critérios
if (responseTime95 &gt; maxResponseTime || errorRate &gt; maxErrorRate) {
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage(
        &quot;Critérios de sucesso não atendidos: &quot; +
        &quot;95% do tempo de resposta = ${responseTime95}ms (máximo permitido: ${maxResponseTime}ms), &quot; +
        &quot;ou taxa de erro = ${errorRate}% (máximo permitido: ${maxErrorRate}%)&quot;
    )
} else {
    log.info(&quot;Critérios atendidos: Percentil 95 = ${responseTime95}ms, Taxa de Erro = ${errorRate}%&quot;)
}
</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223Assertion>
          <hashTree/>
          <ResultCollector guiclass="StatGraphVisualizer" testclass="ResultCollector" testname="Aggregate Graph">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <BeanShellPostProcessor guiclass="TestBeanGUI" testclass="BeanShellPostProcessor" testname="BeanShell PostProcessor" enabled="true">
          <boolProp name="resetInterpreter">false</boolProp>
          <stringProp name="script">import org.apache.jmeter.samplers.SampleResult;

int totalRequests = ctx.getPreviousResult().getTotal();
int failedRequests = ctx.getPreviousResult().getFailureCount();
double errorRate = (failedRequests * 100.0) / totalRequests;

if (errorRate &gt; 1) {
    Failure = true;
    FailureMessage = &quot;Taxa de erro excedeu 1%: &quot; + errorRate + &quot;%&quot;;
}
</stringProp>
        </BeanShellPostProcessor>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>